% Ο παρακάτω κώδικας δέχεται ως είσοδο από τον χρήστη τις συντεταγμένες
% του σημείου που θέλουμε να έχει το end-effector και στη συνέχεια
% δεδομένου του μήκους του κάθε συνδέσμου, υπολογίζεται ο χώρος εργασίας
% και γίνεται έλεγχος για το αν το σημείο βρίσκεται εντος ή εκτός το χώρου
% εργασίας. Γίνεται επίσης και κλήση της συνάαρτησης για την αντίστροφη
% κινηματική ανάλυση.

clear all;
clc;
format compact;

% Τα μήκη των συνδέσμων σε m.
L1 = 2;
L2 = 1;

 % Εισαγωγή συντεταγμένων
px = input("Δώστε την συντεταγμένη x: ");      
py = input("Δώστε την συντεταγμένη y: ");

% Υπολογισμός των ορίων του χώρου εργασίας
r_min = abs(L1-L2);                         
r_max = L1 + L2;                                
r = sqrt(px^2 + py^2);

% Έλεγχος για το αν το σημείο ανήκει στον χώρο εργασίας
if ((r < r_max) & (r > r_min))                                          
    disp("Το σημείο βρίσκεται εντός του χώρου εργασίας του βραχίονα")
    [theta_1_,theta_2_] = inverse_kinimatics_function(px,py)
else
    if (r == r_min)
        disp("Το σημείο βρίσκεται στο εσωτερικό όριο του χώρου εργασίας")
        theta_1_ = inverse_kinimatics_function(px,py)
        theta_2_ = 180;
      else
        if (r == r_max)
            disp("Το σημείο βρίσκεται στο εξωτερικό όριο του χώρου εργασίας")
            theta_1_ = inverse_kinimatics_function(px,py)
            theta_2_ = 0;
         end
    end
end

% Περίπτωση όπου το σημείο δεν ανήκει στον χώρο εργασίας
if ((r>r_max) | (r<r_min))                                      
    disp("Το σημείο βρίσκεται εκτός του χώρου εργασίας.")   
    disp("Παρακαλώ δώστε νέες συντεταγμένες.")
end

