clear all;
clc;
format compact;

% Στοιχεία κινητήρων του ρομποτικού βραχίονα
J = 0.05;
f = 0.2;
K = 0.2;
R = 4;
L = 0.7;

% Συνάρτηση μεταφοράς ελεγχόμενου συστήματος
s = tf('s');
Gp = (2*K)/(s*((J*s+f)*(L*s+R)+K^2));

% Υπολογισμός παραμέτρων PID με τη μέθοδο Ziegler-Nichols
Kcr = 20.4;
Pcr = 1;
Ti = 0.5*Pcr;
Td = 0.125*Pcr;

Kp = 0.6*Kcr;
Ki =Kp/Ti;
Kd = Kp*Td;

% Εύρεση του PID για διάφορες τιμές του Kd
for i=1:3
    C(:,:,i) = pid(Kp,Ki,Kd);
    matrix_deriv(i) = Kd;   % Αποθήκευση των τιμών Kd σε πίνακα
    Kd = Kd + 2;
end

% Εύρεση της βέλτιστης τιμής του Κd σύμφωνα με τις προδιαγραφές
Kd = max(matrix_deriv);

t= 0:0.1:10;    % Εύρος χρόνου για το διάγραμμα απόκρισης

% Συνάρτηση μεταφοράς του κλειστού βρόχου
sys_cl = feedback(Gp*C,1);

% Επιλογή για την ύπαρξη διαταραχής ή όχι
% Οι χαρακτήρες Υ και Ν είναι στα αγγλικά
disp('Παρακαλώ απαντήστε με Y ή N στα αγγλικά')     
answer = input('Θέλετε την απόκριση του συστήματος με διαταραχή;','s')

if (answer == "N")
    % Απόκριση του συστήματος για διάφορες τιμές του Κd
    step(sys_cl(:,:,1), sys_cl(:,:,2), sys_cl(:,:,3), t)
    legend('Kd = 1.53', 'Kd = 3.53','Kd = 5.53')  % Υπόμνημα

    stepinfo(sys_cl(:,:,3))         % Πληροφορίες απόκρισης για Kd=5.53
     
    % Παρουσίαση των παραμέτρων του PID ελεγκτή
     disp("Οι παράμετροι του PID ελεγκτή είναι:")
     disp(['Κp: ' num2str(Kp)])
     disp(['Κi: ' num2str(Ki)])
     disp(['Κd: ' num2str(Kd)])

     disp("Η τελική συνάρτηση μεταφοράς του συστήματος είναι:")
     system = sys_cl(:,:,3)

end

if (answer == "Y")
    % Υπολογιαμός της συνάρτησης μεταφοράς με την είσοδο διαταραχής
    dist_cl = feedback(Gp,C);
    % Απόκριση του συστήματος για διάφορες τιμές του Kd
    step(dist_cl(:,:,1), dist_cl(:,:,2), dist_cl(:,:,3), t)
    legend('Kd = 1.53', 'Kd = 3.53','Kd = 5.53') 

    stepinfo(sys_cl(:,:,3))
     
     disp("Οι παράμετροι του PID ελεγκτή είναι:")
     disp(['Κp: ' num2str(Kp)])
     disp(['Κi: ' num2str(Ki)])
     disp(['Κd: ' num2str(Kd)])

     disp("Η τελική συνάρτηση μεταφοράς του συστήματος είναι:")
     system = sys_cl(:,:,3)

end

% Περίπτωση σφάλματος
if ((answer ~= "Y") & (answer ~= "N"))
    disp('ΣΦΑΛΜΑ!!')
    disp('Παρακαλώ απαντήστε με Υ ή Ν στα αγγλικά')
end

grid on;
