% Ο παρακάτω κώδικας υπολογίζει τους πίνακες του state space
% και τους πίνακες ελεγξιμότητας και παρατήρησης.
% Ελέγχει επίσης και αν το σύστημα είναι ελέγξιμο και παρατηρήσιμο.

clear all;
clc;
format compact;

% Τα στοιχεία των κινητήρων της κάθε άρθρωσης
J = 0.05;
f = 0.2;
K = 0.2;
R = 4;
L = 0.7;

% Η συνάρτηση μεταφοράς του ελεγόμενου συστήματος
s = tf('s');
Gp = (2*K)/(s*((J*s+f)*(L*s+R)+K^2))

% Οι πίνακες του state space
A = [0 1 0
    0 -f/J K/J
    0 -K/L -R/L];
B = [0 ; 0 ; 1/L];                  
C = [1 0 0];
D = [0];

% Η εντολή για το state space
ss(A,B,C,D)                         

% O πίνακας ελεγξιμότητας και
% η ορίζουσά του
Pc = ctrb(A,B);                      
d_contr = det(Pc);                  

% Ο πίνακας παρατήρησης και
% η ορίζουσά του
Po = obsv(A,C);                     
d_observ = det(Po);                 

% Έλεγχος για την ελεγξιμότητα του συστήματος
if (d_contr ~= 0)                               
    disp("Το σύστημα είναι ελέγξιμο.")
else
    disp("Το σύστημα δεν ειναι ελέγξιμο.")
end

% Έλεγχος για το αν το σύστημα είναι παρατηρήσιμο
if (d_observ ~= 0)                                  
    disp("Το σύστημα είναι παρατηρήσιμο.")
else
    disp("Το σύστημα δεν είναι παρατηρήσιμο.")
end

